Catalogs/упАналитическиеРазрезы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАналитическиеРазрезы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПодразделенияПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияСистемыПлатон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упАналитическиеРазрезы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Сформировать наименование
//
// Параметры:
//  Агрегат			 - СправочникСсылка.упШиныУзлыИАгрегаты  	 - агрегат.
//  ВидПеревозки		 - СправочникСсылка.упВидыПеревозок 	 - вид перевозки.
//  Сотрудник			 - СправочникСсылка.упСотрудники 	 - сотрудник.
//  ТранспортноеСредство	 - СправочникСсылка.упТранспортныеСредства 	 - транспортное средство.
// 
// Возвращаемое значение:
//  Строка - наименование аналитического разреза.
//
Функция СформироватьНаименование(Агрегат = Неопределено, ВидПеревозки = Неопределено, Сотрудник = Неопределено, ТранспортноеСредство = Неопределено) Экспорт
	мсвНаименование = Новый Массив;
	Если ЗначениеЗаполнено(Агрегат) Тогда
		мсвНаименование.Добавить(Агрегат);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидПеревозки) Тогда
		мсвНаименование.Добавить(ВидПеревозки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		мсвНаименование.Добавить(Сотрудник);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		мсвНаименование.Добавить(ТранспортноеСредство);
	КонецЕсли;
	Возврат СтрСоединить(мсвНаименование, ";");
КонецФункции

#КонецОбласти

#КонецЕсли
